epf/EX_BigSmB/Catalogs/Counterparties.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Counterparties</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccountByDefault</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntityIndividual</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CodeByOKPO</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CIO</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionFull</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractByDefault</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContactPerson</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TIN</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Individual</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoOperationsByContracts</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>eXiteExchange</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>eXiteInvoice</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>eXiteShipmentReport</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>eXiteOrderConfirmation</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoPaymentsAccountingByBills</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoOperationsByOrders</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>hiGLN</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoOperationsByDocuments</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

epf/EX_BigSmB/Catalogs/Counterparties/Forms/ItemForm/Ext/Form/Module.bsl
&AtClient
Procedure BSB_BeforeWrite(Cancel, WriteParameters)
	
	If Not Modified Then
		Return;
	EndIf;
	
	QuantityEqualCounterparties = QuantityEqualCounterparties(Object.TIN, Object.CIO, Object.Ref);
	If QuantityEqualCounterparties <> 0 Then
		If QuantityEqualCounterparties = 1 Then
			TextCounterparties = НСтр("ru = 'один контрагент';en='one counterparty';ro='un contraparte'");
		ElsIf QuantityEqualCounterparties < 5 Then
			TextCounterparties = String(QuantityEqualCounterparties) 
				+ " " + НСтр("ru = 'контрагента';en='counterparties';ro='contrapartidele'");
		Else
			TextCounterparties = String(QuantityEqualCounterparties) 
				+ " " + НСтр("ru = 'контрагентов';en='counterparties';ro='contrapartidele'");
		EndIf;
		TextQuestion = StringFunctionsClientServer.PlaceParametersIntoString(
			NStr("ru='С таким TIN и CIO уже есть %1. Записать?';
			|en='You have %1 with such TIN and CIO. Save?';
			|ro=''"),
			TextCounterparties);
		Answer = DoQueryBox(TextQuestion, QuestionDialogMode.YesNo);
		If Answer = DialogReturnCode.No Then
			Cancel = True;
		EndIf;
	EndIf;
	
EndProcedure

&AtServerNoContext
Function QuantityEqualCounterparties(Val TIN, Val CIO, val Ref)
	
	If IsBlankString(TIN) And IsBlankString(CIO) Then
		Return 0;
	EndIf;
	
	Query = New Query;
	Query.SetParameter("CIO", CIO);
	Query.SetParameter("TIN", TIN);
	Query.SetParameter("Ref", Ref);
	Query.Text =
	"SELECT
	|	COUNT(Counterparties.Ref) AS QuantityEqualCounterparties
	|FROM
	|	Catalog.Counterparties AS Counterparties
	|WHERE
	|	Counterparties.CIO = &CIO
	|	AND Counterparties.TIN = &TIN
	|	AND Counterparties.Ref <> &Ref
	|	AND NOT Counterparties.IsFolder";
	ResultQuery = Query.Execute();
	If ResultQuery.IsEmpty() Then
		Return 0;
	Else
		Selection = ResultQuery.Select();
		Selection.Next();
		Return Selection.QuantityEqualCounterparties;
	EndIf;
	
EndFunction
